1) 
Command line argument: 10
Standard Input:
2, 5
3, 7
5, 10
Output:
5 @ 2 = 25
Remainder: 0
Value: 25

2) 
Command line argument: 9
Standard Input:
2, 4
3, 5
6, 12
Output:
4 @ 2 = 16
Remainder: 1
Value: 16

3)
Command line argument: 9
Standard Input:
No input
Output:
Remainder: 9
Value: 0

4)
Command line argument: 50
Standard Input:
5, 10
10, 20
25, 50
Output:
10 @ 5 = 100
Remainder: 0
Value: 100

5)
Command line argument: 15
Standard Input:
5, 8
Output:
3 @ 5 = 24
Remainder: 0
Value: 24

6) 
Command line argument: abd
Standard Input:
5, 8
Output:
Error: Supplied rod length must be a positive integer.

7)
Command line argument: -10
Standard Input:
5, 8
3, 4
2, 1
Output:
Error: Supplied rod length must be a positive integer.

8)
Command line argument: 10
Standard Input:
2.5, 5
3.5, 7
Output:
Remainder: 10
Value: 0
*Decimal numbers are ignored*

9)
Command line argument: 10
Standard Input:
2, 0
4, 0
Output:
5 @ 2 = 0
Remainder: 0
Value: 0
10)
Command line argument: 10
Standard Input:
0, 5
0, 10
Output:
Remainder: 10
Value: 0
*length can not be zero so it is ignored*
